{"content": "Neo AI is Harith Kavish's intelligent portfolio assistant, powered by a sophisticated multi-agent RAG (Retrieval-Augmented Generation) system. Neo AI specializes in providing detailed, accurate information about Harith's work, projects, skills, and experience. The system uses specialized layers including Perception (embedding and intent classification), Memory (vector database search across three domains: assistant identity, portfolio projects, and general knowledge), Reasoning (LLM-powered response generation using FLAN-T5), Safety (content validation), and Orchestration (coordinating all services). Neo AI can answer questions about Harith's AI/ML projects, full-stack development work, technical skills in Python, TensorFlow, PyTorch, React, and more. The assistant provides complete, detailed answers with source citations and maintains a conversational, professional tone while always speaking about Harith in third person.", "metadata": {"@type": "SoftwareApplication", "name": "Neo AI", "applicationCategory": "Portfolio Assistant", "description": "Intelligent AI assistant for Harith Kavish's portfolio using multi-agent RAG architecture", "author": "Harith Kavish", "keywords": "AI Assistant, RAG System, Portfolio Chatbot, Multi-Agent Architecture, Natural Language Processing", "capabilities": "Answer questions about projects, skills, experience, provide technical details, cite sources"}}
{"content": "Harith Kavish is an AI Developer and Full-Stack Engineer specializing in machine learning, deep learning, computer vision, and intelligent application development. He has expertise in Python, TensorFlow, PyTorch, Keras, scikit-learn for AI/ML work, and modern web technologies including React, Node.js, JavaScript, HTML/CSS for full-stack development. Harith has experience with cloud computing (AWS, Azure), DevOps tools, database systems (MongoDB, MySQL, PostgreSQL), and version control with Git/GitHub. His work spans multiple domains including healthcare AI (medical image analysis), computer vision (object detection, facial recognition), NLP applications, and full-stack web platforms. Harith Kavish | AI-Driven Systems Architect & Creative Director Harith Kavish AI-Driven Systems Architect & Creative Director Career Objective: To disseminate my experience, knowledge and skills in the professional sphere towards a resourceful mission and in turn take the learning experience for gainfully fulfilling the personal and organizational objectives. Technical Skills: React.js, CSS, JavaScript, HTML Node.js, SpringBoot (Java), MySQL, PostgreSQL Java, Python, GitHub Tableau, Selenium, AWS OpenCV, YOLOv8, TensorFlow, Keras Projects: SkinNet Analyzer: Deep Learning-based skin disease detection system (TensorFlow, Keras, Python, 86.7% accuracy) Multi-Object Detection: Computer Vision with OpenCV, YOLOv8, CNN (TensorFlow, Keras, Cifar10) AgroCloud Finance Pro: Full Stack Finance app (R", "metadata": {"@type": "Person", "name": "Harith Kavish", "jobTitle": "AI Developer", "alternateName": "Full-Stack Engineer", "description": "AI Developer and Full-Stack Engineer specializing in machine learning, deep learning, computer vision, and intelligent application development", "url": "https://harithkavish.github.io/", "sameAs": ["https://github.com/HarithKavish", "https://www.linkedin.com/in/harithkavish/"], "knowsAbout": "Machine Learning, Deep Learning, Computer Vision, NLP, Full-Stack Development, Python, TensorFlow, PyTorch, React, AWS", "skills": "Python, TensorFlow, PyTorch, Keras, scikit-learn, React, Node.js, JavaScript, AWS, MongoDB, MySQL"}}
{"content": "SkinNet-Analyzer: SkinNet Analyzer: A Deep Learning-Based Skin  Disease Detection System - College Final Year (4th year) Project Skin Disease Diagnosis Web App A full-stack AI-powered web application for skin disease diagnosis using deep learning and FastAPI. --- Features - Upload skin images for disease prediction. - Enter your location to get nearby hospital recommendations. - Interactive symptom questions for improved accuracy. - AI-generated disease info and care instructions. - Downloadable PDF report. - Modern React frontend and FastAPI backend. --- Dataset - [Skin Disease Dataset (Kaggle)](https://www.kaggle.com/datasets/subirbiswas19/skin-disease-dataset?resource=download) --- Getting Started Prerequisites - Python 3.8+ - Node.js & npm - pip Backend Setup 1. Install dependencies: ``` pip install -r requirements.txt ``` 2. Run the FastAPI server: ``` uvicorn ml.app:app --host 0.0.0.0 --port 7860 ``` Frontend Setup 1. Navigate to the frontend directory: ``` cd frontend ``` 2. Install dependencies: ``` npm install ``` 3. Start the React app: ``` npm start ``` --- API Endpoints `GET /` - Health check endpoint. `POST /` - Accepts image file (JPEG/PNG). - Returns top 3 disease predictions. --- Project Structure ``` fyp_actual_main/ â”œâ”€â”€ frontend/         # React frontend â”œâ”€â”€ ml/               # FastAPI backend & ML code â”‚   â”œâ”€â”€ app.py â”‚   â””â”€â”€ classify.py â”œâ”€â”€ requirements.txt â””â”€â”€ README.md ``` --- References - [IJIRT Journal Paper](https://ijirt.org/Article?manuscript=174480) - Video Preview: <video src=\"https://github.com/user-attachments/assets/c673a823-58a9-444b-bcb8-493a14a104c1\" controls width=\"60...", "metadata": {"@type": "SoftwareApplication", "name": "SkinNet Analyzer", "applicationCategory": "Healthcare AI", "description": "SkinNet Analyzer: A Deep Learning-Based Skin  Disease Detection System - College Final Year (4th year) Project", "programmingLanguage": "JavaScript", "url": "https://github.com/HarithKavish/SkinNet-Analyzer", "codeRepository": "https://github.com/HarithKavish/SkinNet-Analyzer", "keywords": "efficientnetb0, mobilenet-v3, reactjs, resnet18, skin-disease-detection", "author": "Harith Kavish", "stars": 2}}
{"content": "Multi-Object-Detection-using-YOLO: Multi-Object Detection in Imagery using Computer Vision and Machine Learning - College Mini Project 2 Multi-Object Detection using YOLO and Custom CNN This project performs real-time multi-object detection and image classification using YOLOv8 and a custom-trained CNN on CIFAR-10. It captures webcam video, detects objects, classifies images, and displays results live. Video Preview Original Video Speed: 0.5X [![Demo Video](https://github.com/user-attachments/assets/22620da8-8508-4100-b455-af382fc313c5)](https://github.com/user-attachments/assets/22620da8-8508-4100-b455-af382fc313c5) Features - Real-time object detection using YOLOv8 segmentation - Image classification using a custom CNN trained on CIFAR-10 - Live webcam video processing - Model saving and loading Requirements Install dependencies with: ```bash pip install -r requirements.txt ``` Usage 1. Clone the repository and navigate to the project folder. 2. Ensure you have a webcam connected. 3. Run the main script: ```bash python main.py ``` 4. Follow the prompts to train the model and start detection. 5. Press 'q' to quit the video window. Files - `main.py`: Main script for training and detection - `yolov8n-seg.pt`: YOLOv8 model weights - `image_classifier.keras`: Saved CNN model - `requirements.txt`: Python dependencies Contributors - Harith Kavish S - Sharwan Krishnan P - Sanjay R", "metadata": {"@type": "SoftwareApplication", "name": "Multi Object Detection using YOLO", "applicationCategory": "Computer Vision", "description": "Multi-Object Detection in Imagery using Computer Vision and Machine Learning - College Mini Project 2", "programmingLanguage": "Python", "url": "https://github.com/HarithKavish/Multi-Object-Detection-using-YOLO", "codeRepository": "https://github.com/HarithKavish/Multi-Object-Detection-using-YOLO", "keywords": "multiple-object-detection, yolov8-seg", "author": "Harith Kavish", "stars": 0}}
{"content": "harithkavish.github.io:  --- title: NLWeb Portfolio Chat emoji: ðŸ’¬ colorFrom: blue colorTo: purple sdk: docker pinned: false app_port: 7860 --- NLWeb Portfolio Chat An AI-powered chat interface for Harith Kavish's portfolio using Gemma2:2b and MongoDB vector search. Features - ðŸ¤– Gemma2:2b LLM for intelligent responses - ðŸ” MongoDB Atlas vector search with 0.85+ relevance scores - ðŸ“ Markdown formatting support - ðŸŒ™ Dark/light theme compatibility - âš¡ FastAPI backend with CORS support Usage This Space provides the backend API for the portfolio chat feature at [harithkavish.github.io](https://harithkavish.github.io). Endpoints - `GET /` - Health check - `POST /chat` - Send chat queries - `POST /chat/stream` - Streaming responses - `GET /health` - Detailed health status", "metadata": {"@type": "SoftwareApplication", "name": "harithkavish.github.io", "applicationCategory": "Development Tool", "description": "", "programmingLanguage": "Python", "url": "https://github.com/HarithKavish/harithkavish.github.io", "codeRepository": "https://github.com/HarithKavish/harithkavish.github.io", "keywords": "Python", "author": "Harith Kavish", "stars": 0}}
{"content": "AgroCloud-Finance-Pro: fullstack-Agro_Cloud_Finance_Pro Agro Cloud Finance Pro Advanced Application Development using React+Vite", "metadata": {"@type": "LearningResource", "name": "AgroCloud Finance Pro", "applicationCategory": "Cloud Computing", "description": "fullstack-Agro_Cloud_Finance_Pro", "programmingLanguage": "Java", "url": "https://github.com/HarithKavish/AgroCloud-Finance-Pro", "codeRepository": "https://github.com/HarithKavish/AgroCloud-Finance-Pro", "keywords": "Java", "author": "Harith Kavish", "stars": 0}}
{"content": "Online-Tutoring-Platform: College 2nd Year Main Project", "metadata": {"@type": "SoftwareApplication", "name": "Online Tutoring Platform", "applicationCategory": "Web Application", "description": "College 2nd Year Main Project", "programmingLanguage": "JavaScript", "url": "https://github.com/HarithKavish/Online-Tutoring-Platform", "codeRepository": "https://github.com/HarithKavish/Online-Tutoring-Platform", "keywords": "JavaScript", "author": "Harith Kavish", "stars": 0}}
{"content": "Hands-on_-_Cloud_Computing_using_AWS: An industrial hands-on with AWS, creating EC2, S3 buckets, virtual machines, access control, IAM user creation and configuration, Linux server configuration, MFA, Snapshot creation, Windows server disc creation and partitioning and Windows server remote desktop, Docker containers. Original Video Speed: 0.25X https://github.com/user-attachments/assets/7fbe1695-2a30-4dbc-b7b4-cb1a8480e29a", "metadata": {"@type": "LearningResource", "name": "Hands on   Cloud Computing using AWS", "applicationCategory": "Cloud Computing", "description": "An industrial hands-on with AWS, creating EC2, S3 buckets, virtual machines, access control, IAM user creation and configuration, Linux server configuration, MFA, Snapshot creation, Windows server disc creation and partitioning and Windows server remote desktop, Docker containers.", "programmingLanguage": "Unknown", "url": "https://github.com/HarithKavish/Hands-on_-_Cloud_Computing_using_AWS", "codeRepository": "https://github.com/HarithKavish/Hands-on_-_Cloud_Computing_using_AWS", "keywords": "access-control-list, docker, ec2-instances, iam-policy, iam-users, linux-server-configuration, mfa, remote-desktop, s3-bucket, snapshots, virtual-machine, windows-server", "author": "Harith Kavish", "stars": 0}}
{"content": "Harith Kavish's technical skills include: AI/ML frameworks - TensorFlow, PyTorch, Keras, scikit-learn for building deep learning models; Computer Vision - OpenCV, YOLO, CNNs for object detection and image analysis; NLP - transformers, BERT, GPT for natural language processing; Web Development - React, Node.js, JavaScript, HTML/CSS, RESTful APIs; Backend - Python FastAPI, Flask, Java Spring Boot; Databases - MongoDB, MySQL, PostgreSQL, vector databases; Cloud & DevOps - AWS (EC2, S3, Lambda), Docker, Git/GitHub; Tools - Jupyter, VS Code, Postman, Linux/Windows environments. He has hands-on experience in medical AI (skin disease detection), computer vision (multi-object detection), full-stack web applications (tutoring platforms, financial systems), and cloud infrastructure setup.", "metadata": {"@type": "ItemList", "name": "Technical Skills & Expertise", "description": "Comprehensive technical skill set and areas of expertise", "itemListElement": ["Python", "TensorFlow", "PyTorch", "Keras", "scikit-learn", "Computer Vision", "Deep Learning", "Machine Learning", "NLP", "React", "Node.js", "JavaScript", "FastAPI", "Spring Boot", "MongoDB", "AWS", "Docker", "Git"]}}
{"content": "Harith Kavish specializes in several key areas: Healthcare AI - developing medical imaging systems for skin disease detection using convolutional neural networks and transfer learning; Computer Vision - building real-time object detection systems using YOLO architecture, image classification, and facial recognition; Full-Stack Development - creating complete web applications with React frontends and Node.js/Python backends; Cloud Computing - hands-on AWS experience including EC2 instances, S3 storage, IAM configuration, and serverless architectures; AI/ML Engineering - designing and training deep learning models for various applications from medical diagnosis to autonomous systems. He combines theoretical knowledge with practical implementation skills to build production-ready intelligent applications.", "metadata": {"@type": "CreativeWork", "name": "Areas of Expertise", "description": "Specialized domains and professional expertise", "keywords": "Healthcare AI, Computer Vision, Medical Imaging, Object Detection, Full-Stack Development, Cloud Architecture, Machine Learning Engineering"}}
